IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/RTI8_CFG.xml
	<register id="CFG_COMP2" acronym="CFG_COMP2" offset="0x60" width="32" description="">
		<bitfield id="COMP2" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, an  interrupt is flagged. With this register it is also possible to initiate a DMA request.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_UDCP2" acronym="CFG_UDCP2" offset="0x64" width="32" description="">
		<bitfield id="UDCP2" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a value, which is added to the value in the compare 2 register each  time a compare matches. This gives the possibility to generate periodic interrupts without  software intervention.  User and privilege mode (read):  value to be added to the compare 2 register on the next compare match  Privilege mode (write):  new update value" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMP3" acronym="CFG_COMP3" offset="0x68" width="32" description="">
		<bitfield id="COMP3" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, an  interrupt is flagged. With this register it is also possible to initiate a DMA request.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_UDCP3" acronym="CFG_UDCP3" offset="0x6C" width="32" description="">
		<bitfield id="UDCP3" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a value, which is added to the value in the compare 3 register each  time a compare matches. This gives the possibility to generate periodic interrupts without  software intervention.  User and privilege mode (read):  value to be added to the compare 3 register on the next compare match  Privilege mode (write):  new update value" range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TBLCOMP" acronym="CFG_TBLCOMP" offset="0x70" width="32" description="">
		<bitfield id="TBLCOMP" width="32" begin="31" end="0" resetval="0x0" description="  This value determines when the edge detection circuit starts monitoring the NTUx signal. It  will be compared with Up Counter 0.  User and privilege mode (read):  current compare value  Privilege mode (write when TBEXT = 0):  the compare value is updated  Privilege mode (write when TBEXT = 1):  the compare value is not changed  Note: Reset behavior  A reset does not generate a compare match." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_TBHCOMP" acronym="CFG_TBHCOMP" offset="0x74" width="32" description="">
		<bitfield id="TBHCOMP" width="32" begin="31" end="0" resetval="0x0" description="  This value determines when the edge detection circuit will stop monitoring the NTUx signal.  It will be compared with Up Counter 0.  RTITBHCOMP has to be less than RTICPUC0, since RTIUC0 will be reset when  RTICPUC0 is reached.  Example:  The NTUx edge detection circuit should be active +/- 10 RTICLK cycles around RTICPUC0.  RTICPUC0 = 0x00000050  RTITBLCOMP = 0x000046  RTITBHCOMP = 0x00000009  User and privilege mode (read):  current compare value  Privilege mode (write when TBEXT = 0):  the compare value is updated  Privilege mode (write when TBEXT = 1):  the compare value is not changed  Note: Reset behavior  A reset does not generate a compare match." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_SETINT" acronym="CFG_SETINT" offset="0x80" width="32" description="">
		<bitfield id="SETOVL1INT" width="1" begin="18" end="18" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="18" rwaccess="R/W1TS"/> 
		<bitfield id="SETOVL0INT" width="1" begin="17" end="17" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="17" rwaccess="R/W1TS"/> 
		<bitfield id="SETTBINT" width="1" begin="16" end="16" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="16" rwaccess="R/W1TS"/> 
		<bitfield id="SETDMA3" width="1" begin="11" end="11" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable DMA request " range="11" rwaccess="R/W1TS"/> 
		<bitfield id="SETDMA2" width="1" begin="10" end="10" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable DMA request " range="10" rwaccess="R/W1TS"/> 
		<bitfield id="SETDMA1" width="1" begin="9" end="9" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable DMA request " range="9" rwaccess="R/W1TS"/> 
		<bitfield id="SETDMA0" width="1" begin="8" end="8" resetval="0x0" description="  User and privilege mode (read):  0 = DMA request is disabled  1 = DMA request is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable DMA request " range="8" rwaccess="R/W1TS"/> 
		<bitfield id="SETINT3" width="1" begin="3" end="3" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SETINT2" width="1" begin="2" end="2" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="2" rwaccess="R/W1TS"/> 
		<bitfield id="SETINT1" width="1" begin="1" end="1" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt " range="1" rwaccess="R/W1TS"/> 
		<bitfield id="SETINT0" width="1" begin="0" end="0" resetval="0x0" description="  User and privilege mode (read):  0 = interrupt is disabled  1 = interrupt is enabled  Privilege mode (write):  0 = leaves the corresponding bit unchanged  1 = enable interrupt" range="0" rwaccess="R/W1TS"/>
	</register>
