IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/RTI8_CFG.xml
	<register id="CFG_COMP1CLR" acronym="CFG_COMP1CLR" offset="0xB4" width="32" description="">
		<bitfield id="COMP1CLR" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, the  compare 1 interrupt or DMA request line is cleared.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMP2CLR" acronym="CFG_COMP2CLR" offset="0xB8" width="32" description="">
		<bitfield id="COMP2CLR" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, the  compare 2 interrupt or DMA request line is cleared.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="CFG_COMP3CLR" acronym="CFG_COMP3CLR" offset="0xBC" width="32" description="">
		<bitfield id="COMP3CLR" width="32" begin="31" end="0" resetval="0x0" description="  This registers holds a compare value, which is compared with the counter selected in the  compare control logic. If the Free Running Counter matches the compare value, the  compare 3 interrupt or DMA request line is cleared.  User and privilege mode (read):  current compare value  Privilege mode (write):  update of the compare register with a new compare value  Note: Reset behavior  A reset does not generate a compare match, since the compare logic will only be  active, when the associated counter block is enabled." range="31 - 0" rwaccess="R/W"/>
	</register>
</module>